{"pages": [["Robust Reliability Engine for Adaptive LLM Training", "The Robust Reliability Engine (RRE) is an end-to-end system that continuously monitors and improves a large language model’s reliability. It addresses the key enterprise challenges: LLM outputs often “hallucinate” incorrect facts, and model performance drifts over time as data changes. RRE combines multi-axis Reliability Scoring, prompt optimization, and reinforcement learning from human feedback to minimize hallucinations and factual errors, adapt to drift, and provide full visibility. In the pipeline, every user prompt and model response is evaluated for factual correctness, coherence, safety, etc., yielding an overall Reliability Score (RS). Low-RS outputs trigger feedback loops (human review or automated checks), which feed into a reward model. The LLM is then updated via RLHF (PPO or DPO) to maximize RS. Over time, this closes the loop: the model gets demonstrably better (higher RS and lower error rates) on real data.", "", "RRE runs on scalable cloud infrastructure (initially AWS) with optional on-prem deployment for sensitive data. All system activities are logged and visualized: dashboards show RS trends, hallucination rates, drift alerts, and training effects in real time. In effect, RRE builds a “self-healing” LLM: it learns from usage, corrects mistakes, and adapts to new domains. This is a strategic differentiator versus static LLM services. Whereas generic LLM solutions focus on peak accuracy, RRE prioritizes trustworthiness and transparency. For example, research shows that unaddressed hallucinations significantly erode trust and slow enterprise AI adoption; RRE’s integrated pipeline directly targets this. In sum, RRE delivers enterprise-grade AI by quantifying and optimizing reliability on multiple fronts (factuality, coherence, safety), with clear metrics for both engineers and executives\t.", "", "System Architecture", "The RRE architecture is a modular pipeline from Prompt → Model → Evaluation → Learning → Monitoring. User prompts are ingested (via an API or UI) and sent to the base LLM. The LLM’s response is first passed through an RS Evaluation Module, which computes sub-scores (factuality, relevance, logical coherence, style, safety, etc.) and aggregates them into a single Reliability Score. This RS is logged in a time- series database. If RS falls below a threshold or violates policy (e.g. detected toxicity), the response can be flagged for human review or automatically discarded. Meanwhile, all prompts and responses (plus RS and context) are stored for analytics and training.", "", "Periodically, the system enters a training loop (triggered offline or on schedule). First, a Human Feedback Capture phase collects labels or rankings for model outputs: either via a managed labeling service or user interface (e.g. crowdworker judges each answer). This preference data trains a Reward Model. Then the LLM is fine-tuned with reinforcement learning: it generates answers (via an “environment” that simulates usage) and uses PPO (or DPO) to update its policy to maximize the reward model’s scores. The updated model is deployed to production. Importantly, the reward model is designed so that high reliability (high RS) is rewarded.", "", "", "Figure: High-level RLHF training pipeline. (1) SFT collects human demonstrations; (2) a reward model is trained on ranked outputs; (3) the model policy is optimized with PPO.", "", "A schematic of the RLHF loop used in RRE. We begin with supervised fine-tuning (SFT) on demonstration data. Then humans rank or rate model outputs to create a preference dataset. We train a neural reward model to predict these preferences. Finally, PPO is used to optimize the LLM policy to maximize this learned reward. In RRE, the reward model incorporates the multi-axis RS (fact-check signals, coherence checks, etc.) so that the LLM learns to produce more reliable outputs. We may also employ Direct Preference Optimization (DPO) as an alternative: given a dataset of ranked outputs, DPO adjusts the policy directly without separate reward modeling. (For example, AWS notes that DPO “bypasses reward modeling and exploration” to directly fine-tune on preferences.)", "", "Aside from the RLHF loop, monitoring and drift detection run continuously in production. New input data is profiled (e.g. feature statistics, prompt categories) and compared against historical baselines. Figure below illustrates a typical drift-monitoring flow: the system monitors data quality and model output quality and triggers retraining if divergences are detected\t.", "", "", "Figure: Stages in detecting data and model drift. Incoming data is profiled and compared to the training data distribution (data quality monitoring); the model’s prediction accuracy is also tracked (model quality monitoring). Significant deviations trigger a retraining pipeline.", "", "The system continuously checks for drift. Data drift means the distribution of new prompts or inputs has shifted (e.g. new domain, new language use), which can degrade model performance. RRE uses statistical tests or distance metrics (as in Evidently AI) to quantify these shifts. Model drift means the model’s accuracy on known tasks is falling (e.g. as measured on a held-out benchmark or recent labeled examples). When either type of drift is detected, RRE automatically schedules a new training cycle,", "", "incorporating the latest data. Tools like AWS SageMaker Model Monitor or Clarify can implement this feedback loop in the cloud.", "", "Core Components", "Reliability Score (RS) Tracking", "RRE defines a multi-dimensional Reliability Score for each output. Typical sub-scores include factuality (is the content true vs. hallucinated?), answer-context relevance, logical coherence, stylistic appropriateness, and safety (no disallowed content). For example, factuality might be estimated by querying a knowledge base or by checking answer consistency under varied prompts. The recent ACL 2024 paper MONITOR illustrates this idea: it measures an LLM’s factual reliability by comparing output distributions under different phrasing of the same fact. Similarly, RRE’s RS could incorporate such distributional consistency checks. A perfect answer (verifiably correct and consistent) would score near 1.0, while hallucinations or contradictions yield lower factuality subscores and thus a low RS overall.", "", "All sub-scores and the aggregate RS are logged for analysis. Time-series of RS let us quantify improvement over RLHF rounds (e.g. “RS increased from 0.80 to 0.93 on average”). RS also drives decision logic: for instance, if an answer’s RS < 0.5 the system might automatically reject it or flag for human approval. This helps enforce the user’s trust; indeed, alignment research emphasizes that a model should “refuse” to answer beyond its knowledge to avoid errors. In fact, one study explicitly defines an alignment goal of model reliability – “accurate responses while adeptly rejecting questions beyond its knowledge boundaries” – and shows that training a reward model to encourage rejections greatly reduces hallucinations. Our RS encapsulates this by penalizing low-confidence, uncertain outputs.", "", "Entropy Calibration", "LLMs can be miscalibrated – their reported confidence (entropy) does not match true accuracy. RRE incorporates entropy calibration so that the model’s output probability distribution reflects real uncertainty. Recent ICLR work notes that, in practice, base LMs become under-confident over long generations (entropy grows) and instruction-tuned LMs are often overconfident. RRE applies techniques (e.g. scaling logits or “future entropy scaling”) so that a high-confidence answer indeed corresponds to high factuality. In other words, low-entropy (overly certain) outputs are penalized unless they are justified. Proper calibration ensures that the RS’s confidence components are meaningful: an answer flagged as “0.8 confident” should statistically be correct ~80% of the time. Calibration adjustment can be done per-token or globally (see On Entropy Calibration). Ultimately, this reduces dangerous overconfidence: if the model truly isn’t sure, it yields a higher-entropy output that triggers fallback (refusal or human review).", "", "Prompt Template Optimization", "RRE continuously optimizes prompt templates to further reduce errors. Given a task, initial prompts (possibly human-designed) are systematically improved. For example, RRE might prepend clarifying instructions (“Use only publicly verifiable facts, or respond ‘Unknown’”) or provide few-shot examples that steer the style. Such prompt engineering can be automated: one can treat prompt wording as parameters to optimize, using reinforcement learning or gradient-free search guided by RS feedback. Recent research (e.g. the Align-Pro framework) shows that optimizing the input prompt can align a frozen LLM to desired outputs, effectively trading computation on prompt design for parameter updates. In practice, RRE", "", "might run an inner loop: try variants of a prompt on sample queries, compute the resulting RS distribution, and keep the best-performing templates.", "", "Clear prompting is critical: vague or contradictory prompts lead to bad answers. For instance, asking “What’s the best treatment?” without context often yields nonsense; adding specifics (“for a 50-year-old male with X condition”) yields a coherent medically-grounded answer. As a concrete example, consider a medical query prompt. RRE might compare two templates: one that says “You are a doctor” vs. one that says “You are an AI medical assistant.” By testing these on a validation set, RRE can empirically determine which phrasing gives higher RS (fewer hallucinations). Over time, we freeze optimal templates into production. This hallucination-resistant prompting works alongside RLHF: even before learning, good prompts ensure fewer errors.", "", "Drift Detection and Adaptation", "In deployment, RRE monitors for data and concept drift. Data drift means users start asking different kinds of questions or in a new style (e.g. new product terminology, slang, or topics); concept drift means the world changed (e.g. new laws, events) making old training outdated. RRE continually compares incoming data features to the baseline (training) distribution. For example, it can track summary statistics of token frequencies, new vocabulary, or prompt categories. It also monitors model outputs: significant drops in RS or increases in flagged errors over time indicate drift. These checks can be implemented with tools like Amazon SageMaker Model Monitor or custom analytics pipelines\t.", "", "When drift is detected beyond thresholds, RRE triggers a retraining workflow: it collects recent real data, optionally gathers new human feedback, and retrains the model (SFT + RLHF) to adapt. For example, if suddenly many queries about a new regulation start appearing and the model’s answers are low-RS, the system will automatically fine-tune on new examples (possibly with augmentation from knowledge bases). This ensures long-term robustness: the LLM does not remain static in a changing environment.", "", "Feedback Capture and Pipelines", "Human feedback drives RLHF. RRE includes interfaces (web UI or API) for collecting ratings on model outputs. This can be fully integrated: for instance, users can “thumbs-up/thumbs-down” answers, or specialized reviewers can rate helpfulness and truthfulness. In the MVP, we might use a managed service like Amazon SageMaker Ground Truth Plus, which provides annotation workflows and even a workforce for labeling. Ground Truth can take anonymized prompt-response pairs and generate preference labels at scale, feeding directly into our reward model training. The feedback (answers ranked or rated) is stored in S3 or a database.", "", "RRE also supports implicit feedback: session data (e.g. user clicked a link in the answer, time spent) can signal satisfaction. Even automated signals (e.g. internal consistency checks or comparison against a reference corpus) enrich the reward dataset. All feedback sources are cleaned and weighted appropriately. The key is scalability: as usage grows, the system can onboard more annotators or crowd services so that RLHF training has fresh, high-quality data.", "", "RLHF Training (PPO/DPO)", "With feedback collected, RRE fine-tunes the LLM in a loop. Initially the base model is supervised-fine-tuned (SFT) on any available in-domain examples (to set a decent starting point). Then we train the reward model on human preferences (SFT-based preference modeling). Finally, we perform policy optimization using PPO: the LLM generates candidate responses for prompts, receives reward-model scores (reflecting RS), and updates its parameters to increase expected reward. This three-step cycle (SFT, reward training, PPO) may repeat multiple times as the LLM improves.", "", "Direct Preference Optimization (DPO) is an alternative: given a static preference dataset, DPO updates the model to directly maximize preference likelihood, skipping the explicit reward-model step. We will evaluate DPO versus PPO for efficiency. Additionally, RRE can incorporate ideas from RLAIF (AI Feedback):", "i.e. use specialized LLMs as “judges” to rate outputs. For example, one LLM might evaluate answers for", "factuality and another for toxicity; their averaged score can augment or replace human labels, as shown in Figure 1 (right). This Constitutional-AI style approach speeds up reward data creation (multiple LLMs can cheaply rank thousands of responses). However, human oversight remains critical for fine-grained alignment.", "", "", "Figure: RLHF vs. RLAIF. In standard RLHF (left), a learned reward model (trained on human rankings) scores each LLM response. In RLAIF (right), multiple LLMs (each specialized for e.g. relevance, toxicity, conciseness) provide scores which are averaged.", "", "Figure: The RRE framework is flexible: it can use either human feedback (RLHF) or automated LLM-based feedback (RLAIF). AWS illustrates that RLAIF (right) can specialize LLMs as evaluators for different qualities", ". RRE could incorporate this by periodically using auxiliary LLMs to double-check answers (e.g. “is this response factually correct?”), thus scaling feedback.", "", "Example Prompt Flows and Scoring", "Below are illustrative examples of how RRE would score prompts and responses. Each response is decomposed into sub-scores contributing to the overall RS (0–1). These examples are hypothetical but reflect real flows:", "", "User Prompt\tLLM Response", "Factuality\tCoherence\tSafety\tOverall", "RS", "Notes", "", "", "In these flows, RRE would flag the low-RS cases for correction. For the Mars landing query, the LLM “hallucinated” a false fact, so factuality is near zero, resulting in a low overall RS. This would trigger an update (e.g. more training data or a prompt rephrase). In the hacking example, the system prioritizes safety: it refuses to answer, yielding an overall RS reflecting policy violation (human or an internal content filter would enforce this).", "", "These examples illustrate sub-score reasoning: ambiguous or poorly-specified prompts (like the typo example) are improved via prompt optimization (RRE might autocorrect the prompt or ask for clarification).", "They also show that factuality is critical: even a coherent answer is rejected if it’s false. RRE can use", "techniques like metamorphic prompt variants (as in MetaQA) to detect such hallucinations.", "", "AWS Cloud Stack (and On-Prem Blueprint)", "AWS Cloud (MVP deployment): RRE will leverage AWS managed services for scalability:", "", "Data Storage: Amazon S3 for all datasets, model checkpoints, and logs. Optionally DynamoDB or Amazon RDS for metadata.", "", "Compute/Training: Amazon SageMaker – using", "or", "instances (GPUs) for fine-", "", "tuning, reward-model training, and PPO. SageMaker’s built-in RLHF tooling (e.g. RLlib or TRLX in a Studio notebook) can accelerate development. SageMaker Ground Truth (Plus) is used for collecting human labels.", "Data Processing: AWS Glue or SageMaker Data Wrangler for preparing fresh data batches.", "SageMaker Feature Store can manage any engineered features for RS evaluation.", "Monitoring: SageMaker Model Monitor (for drift), SageMaker Clarify (for bias analysis), and Amazon CloudWatch (for system metrics and custom RS/accuracy metrics). Alerts are set up in CloudWatch or EventBridge on predefined thresholds.", "Orchestration: AWS Step Functions coordinate the pipeline (preprocessing → training → evaluation", "* deployment). AWS Lambda functions can trigger retraining when drift is detected or significant feedback accumulates.", "Security/Network: Resources run in a VPC. IAM roles grant least-privilege access. Data in S3 is", "encrypted by KMS. AWS Secrets Manager stores API keys or database credentials.", "", "For visualization, Amazon QuickSight or CloudWatch Dashboards display executive metrics (RS trends, hallucination rate, uptime) and engineer dashboards (training loss curves, prompt test comparisons). A web interface (hosted on Elastic Beanstalk or Amplify) lets developers experiment with prompts and view feedback.", "", "On-Premise Blueprint (Enterprise Scale-up): In a private datacenter, the architecture would be analogous:", "", "Kubernetes Cluster: Using NVIDIA GPUs (e.g. DGX servers or V100/A100 cards). Deploy Kubeflow or KServe for model training/inference workflows.", "Storage: On-prem object store (MinIO or Ceph) in place of S3; on-prem databases.", "MLOps Tools: Kubeflow Pipelines or MLflow in lieu of SageMaker. Open-source inference stacks (TorchServe or Triton).", "Monitoring: Prometheus/Grafana (instead of CloudWatch) for live metrics; ElasticSearch/Kibana for logs.", "UI: Internal web apps (React) with secured access.", "Hybrid Options: AWS Outposts could mirror the cloud stack on-premises if hybrid operation is needed.", "In both cloud and on-prem setups, the core pipeline logic remains the same, ensuring consistent metrics and workflows across environments.", "", "Project Timeline, Cost, and Staffing", "MVP Phase (6–9 months): Core RRE capabilities built and tested. A small cross-functional team is needed, e.g. 3 ML engineers (modeling/RLHF), 2 DevOps/infra engineers (AWS setup, data pipelines), 1 data engineer, 1 UX engineer, and 1 product/PM. Tasks: implement RS evaluation modules, set up", "", "AWS infrastructure, run initial RLHF experiments on a medium-sized model (~7–13B parameters), and build prototype dashboards. Computing costs (GPU time on SageMaker) might be on the order of $\\$50$–$\\$150$K, depending on iterations. (By comparison, training a 175B model cost ~$0.5$–", "$4.6M in 2020, so a 13B fine-tuning project is orders of magnitude less.)", "", "Scale-up Phase (12–18 months): Expand to enterprise grade. Possibly 15–20 staff: additional ML researchers (for advanced RS algorithms), MLOps engineers, SREs, QA. Tasks: optimize and parallelize training, migrate to high-performance clusters, integrate security/compliance features, and finalize productized UI. GPU/cloud costs scale up as model size and usage grows, potentially reaching hundreds of thousands per year (multiple full training runs at scale). For context, training cutting-edge models (GPT-4, Gemini Ultra) reportedly cost tens to hundreds of millions ; our narrower RLHF loops will be a fraction of that. Still, budgeting should account for sustained heavy GPU usage and large-scale human labeling.", "", "A projected budget might be on the order of \\$1–2M (personnel + compute) for the first 1–2 years. Time to ROI depends on application: in high-stakes domains (medicine, legal), reducing a single critical error can easily justify these costs. RRE’s design allows incremental deployment: we can start with a smaller domain- specific model (e.g. a 7B-parameter model on AWS) and grow gradually to a general-purpose model.", "", "Metrics and Success Criteria", "We will track quantitative metrics at every layer:", "", "Reliability Score Improvement: Average RS on a validation set (or in-production) before vs after updates. Successful training should raise mean RS and shrink variance.", "Hallucination Rate: Percentage of outputs flagged as incorrect or unverifiable (e.g. via MetaQA or manual review). We aim for a steady decline (e.g. “80% reduction in verified hallucinations over 6 months”).", "Drift Detection: Number of drift incidents detected and resolved per period. A decrease in", "unhandled drift events indicates success.", "Reward Learning Efficiency: Tracking PPO rewards or loss vs. training steps. For example, we measure how many RLHF iterations are needed to gain 0.1 RS improvement. Fewer iterations = higher efficiency.", "User/Stakeholder Metrics: End-user satisfaction surveys or task success rates (if applicable), and", "stakeholder-defined metrics (e.g. compliance scores).", "Operational KPIs: Query throughput and latency of the system (should meet SLAs), annotation throughput (how fast feedback is processed), and cost per query.", "These metrics will be visible on dashboards. In particular, continual tracking of RS deltas and hallucination counts provides a clear safety indicator. Industry guidance emphasizes that observability and feedback loops are key to safe LLM deployment . For example, Fiddler AI notes that monitoring perplexity, coherence, and answer-context relevance helps catch problems early  . We will use such metrics (plus our custom RS) as leading indicators. A successful proof-of-concept might define targets like “RS increased by X%, hallucination rate reduced by Y% after N iterations.”", "", "Strategic Differentiation and Applications", "RRE is fundamentally different from existing LLM services. Major LLM platforms (GPT-4.5, Gemini, etc.) do not expose their internal reliability metrics nor continually adapt after deployment. In contrast, RRE offers:", "", "Transparency: Stakeholders see exactly how the model is performing (RS trends, error rates, drift alerts). This transparency builds trust. For instance, executives can watch key metrics improve over time, addressing the “black box” concern. (The notion of a reliability score itself is novel – aside from research metrics like MONITOR, mainstream LLMs don’t score their own trustworthiness for users.)", "Continuous Learning: RRE is designed to learn from production data and feedback, not remain", "static. This guards against performance degradation in the field. Current LLM solutions have no integrated drift correction; our built-in monitoring and retraining loops ensure the model stays up- to-date.", "Customizability: Enterprises can weight the axes of RS by business needs (e.g. prioritize factuality in", "a news domain, or safety in customer service). Off-the-shelf LLMs have fixed behaviors. RRE’s prompt templates and reward functions are fully configurable.", "Safety and Compliance: By default, RRE includes safety filters and refusal policies. Unlike generic", "LLMs, which sometimes produce harmful content, our pipeline enforces “guardrails”\t(e.g. refusing dangerous requests, filtering hate speech) at every step. We also log all decisions for audit.", "Enterprise Integration: RRE comes with enterprise features (on-prem deployment, VPC, role-based", "access, data governance) baked in. This is a contrast to public LLM APIs, which can’t meet strict compliance or data residency requirements.", "These capabilities open doors to applications where trust is critical: - Regulated Industries: Healthcare, finance, and legal domains can use RRE to ensure answers are evidence-based and auditable. - Knowledge Work: RRE can power corporate Q&A systems or search assistants with higher factuality guarantees. - Dynamic Domains: Sectors like cybersecurity or policy (where facts change rapidly) benefit from automatic drift adaptation.", "", "In sum, RRE shifts the paradigm from “high-performing but opaque” LLMs to “reliable, self-improving AI assistants.”", "", "Naming, UI/UX, and Extensions", "A good product name could emphasize trust: examples include “Reliability Engine”, “TrustAI Platform”, or “GuardGPT”. The user interface should cater to both executives and engineers:", "", "Executive Dashboard: A high-level “control panel” showing overall Reliability Score trends, error/ hallucination rates, and alert status. Graphs (e.g. RS over time, drift probability) use plain language. KPI tiles summarize success (e.g. “Average RS ↑ 12% this quarter”). Non-technical stakeholders get visibility into the system’s health without deep ML jargon.", "Technical Console: A developer view with drill-downs. This includes detailed logs of prompts/RS, a", "Prompt Testbed (where engineers can input custom prompts and see sub-scores), and model training monitors (PPO reward curves, loss curves, etc.). Graphs of drift statistics, confusion matrices for factual checks, and annotation interfaces for feedback ensure engineers can debug and refine the system.", "", "Optional modules to enhance trust: - Explainability Module: Integrate an LLM-based explainer that, upon request, generates a justification for each answer (e.g. chain-of-thought or evidence citation). While the main model focuses on answers, a secondary explanation output can aid user trust. For example, a prompt like “Explain why this answer is correct” can be rerouted to an LLM trained to justify responses.", "User Trust Scoring: In addition to RS, compute a trust level for each answer (e.g. High/Medium/Low). This", "could use additional signals like model self-confidence or rubric tests. Low-trust answers might be presented with disclaimers or re-routed to human review.", "Safety Filters: Build in content moderation layers. Simple keyword/blocklist filters handle obvious issues,", "and a specialized toxicity classifier (or an LLM “guard” as in Constitutional AI) checks outputs for subtle harm. These guardrails are triggered before presenting results. As a best practice, we implement operational boundaries so the model “won’t talk about certain topics”.", "", "In UI/UX, consistency and clarity are paramount. We recommend a responsive web app with role-based views. The brand visuals should convey stability and trust (e.g. cool color schemes, confidence icons). Tooltips and documentation should explain the meaning of RS and each metric in simple terms. For example, hovering over an “RS” number could show: “This score (0–1) measures factual accuracy and consistency of the response (1.0 = fully reliable).” By making the system’s reasoning transparent, RRE not only improves the model but also educates users on AI limitations.", "", "In summary, the Robust Reliability Engine is a holistic platform: it blends cutting-edge ML (RLHF with multi-factor rewards) with rigorous DevOps (continuous monitoring, on-demand retraining) and user- centric design (dashboards, explainability). Citations throughout this proposal highlight that each component is grounded in recent advances. Together, they form a concrete path to an enterprise LLM solution that is not only powerful, but trustworthy and transparent – meeting the highest standards that modern AI applications demand.", "", "Sources: Key references include AWS’s LLM fine-tuning architectures, industry best practices for monitoring and hallucinatory risk, and recent research on factual reliability metrics (MONITOR) and model honesty. These inform our design of the RS metric, prompt optimization strategy, and feedback pipelines. All cited literature underscores the importance of reliability and user-aligned evaluation in modern LLM development.", "Appendix A: Acronym Glossary", "", "", "", "SOURCES:", "LLM hallucinations: Complete guide to AI errors | SuperAnnotate ", "https://www.superannotate.com/blog/ai-hallucinations ", "Detect Hallucinations Using LLM Metrics | Fiddler AI Blog ", "https://www.fiddler.ai/blog/detect-hallucinations-using-llm-metrics ", "Proceedings of the 2024 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies (Volume 1: Long Papers) - ACL Anthology https://aclanthology.org/volumes/2024.naacl-long/ ", "Improving your LLMs with RLHF on Amazon SageMaker | AWS Machine Learning Blog ", "https://aws.amazon.com/blogs/machine-learning/improving-your-llms-with-rlhf-on-amazon-sagemaker/ ", "Fine-tune large language models with reinforcement learning from human or AI feedback | AWS Machine Learning Blog ", "https://aws.amazon.com/blogs/machine-learning/fine-tune-large-language-models-with-reinforcement-learning-from-human-or- ai-feedback/ ", "Detecting data drift using Amazon SageMaker | AWS Architecture Blog ", "https://aws.amazon.com/blogs/architecture/detecting-data-drift-using-amazon-sagemaker/ ", "What is data drift in ML, and how to detect and handle it ", "https://www.evidentlyai.com/ml-in-production/data-drift ", "[2502.15844] Hallucination Detection in Large Language Models with Metamorphic Relations ", "https://arxiv.org/abs/2502.15844 ", "Rejection Improves Reliability: Training LLMs to Refuse Unknown Questions Using RL from Knowledge Feedback ", "https://arxiv.org/html/2403.18349v2 ", "On the Entropy Calibration of Language Models | OpenReview ", "https://openreview.net/forum?id=ZpQ2SqQNXf ", "Align-Pro: A Principled Approach to Prompt Optimization for LLM Alignment ", "https://arxiv.org/html/2501.03486v1 ", "What is the cost of training large language models? ", "https://www.cudocompute.com/blog/what-is-the-cost-of-training-large-language-models ", ""]]}